load_testing/results_for_report/dyn_3_phases_360s_100keys.txt
CONNECTED to addr	172.31.11.13:3000
CONNECTED to addr	172.31.10.136:3000
all addrs:
1	172.31.11.13:3000
2	172.31.10.136:3000
thread addr: 172.31.11.13:3000
all addrs:
1	172.31.11.13:3000
2	172.31.10.136:3000
thread addr: 172.31.10.136:3000
Running 6m test @ http://172.31.11.13:3000/
  2 threads and 200 connections
  Thread calibration: mean lat.: 2066.727ms, rate sampling interval: 7000ms
  Thread calibration: mean lat.: 2129.640ms, rate sampling interval: 7114ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   171.84ms  613.85ms   6.72s    93.93%
    Req/Sec     1.76k    65.49     2.05k    83.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.19ms
 75.000%   28.58ms
 90.000%  143.74ms
 99.000%    3.42s 
 99.900%    5.11s 
 99.990%    6.41s 
 99.999%    6.63s 
100.000%    6.72s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.296     0.000000            1         1.00
       2.559     0.100000       123586         1.11
       4.515     0.200000       246838         1.25
       8.927     0.300000       370141         1.43
      11.167     0.400000       493735         1.67
      14.191     0.500000       616934         2.00
      16.063     0.550000       678549         2.22
      18.255     0.600000       740431         2.50
      20.847     0.650000       802174         2.86
      24.159     0.700000       863755         3.33
      28.575     0.750000       925455         4.00
      31.407     0.775000       956269         4.44
      35.007     0.800000       987197         5.00
      39.903     0.825000      1017856         5.71
      47.871     0.850000      1048718         6.67
      68.735     0.875000      1079535         8.00
      92.159     0.887500      1094927         8.89
     143.743     0.900000      1110354        10.00
     256.511     0.912500      1125772        11.43
     455.935     0.925000      1141189        13.33
     735.231     0.937500      1156622        16.00
     929.279     0.943750      1164339        17.78
    1169.407     0.950000      1172053        20.00
    1469.439     0.956250      1179750        22.86
    1785.855     0.962500      1187452        26.67
    2140.159     0.968750      1195164        32.00
    2301.951     0.971875      1199060        35.56
    2469.887     0.975000      1202886        40.00
    2652.159     0.978125      1206747        45.71
    2848.767     0.981250      1210615        53.33
    3047.423     0.984375      1214466        64.00
    3145.727     0.985938      1216407        71.11
    3241.983     0.987500      1218303        80.00
    3352.575     0.989062      1220242        91.43
    3471.359     0.990625      1222161       106.67
    3594.239     0.992188      1224078       128.00
    3663.871     0.992969      1225042       142.22
    3741.695     0.993750      1226033       160.00
    3827.711     0.994531      1226981       182.86
    3928.063     0.995313      1227941       213.33
    4040.703     0.996094      1228902       256.00
    4110.335     0.996484      1229379       284.44
    4202.495     0.996875      1229886       320.00
    4300.799     0.997266      1230351       365.71
    4411.391     0.997656      1230838       426.67
    4521.983     0.998047      1231317       512.00
    4591.615     0.998242      1231552       568.89
    4681.727     0.998437      1231799       640.00
    4800.511     0.998633      1232036       731.43
    4976.639     0.998828      1232280       853.33
    5128.191     0.999023      1232514      1024.00
    5222.399     0.999121      1232636      1137.78
    5312.511     0.999219      1232755      1280.00
    5427.199     0.999316      1232873      1462.86
    5562.367     0.999414      1232996      1706.67
    5742.591     0.999512      1233114      2048.00
    5820.415     0.999561      1233176      2275.56
    5877.759     0.999609      1233236      2560.00
    5951.487     0.999658      1233295      2925.71
    6037.503     0.999707      1233356      3413.33
    6111.231     0.999756      1233417      4096.00
    6143.999     0.999780      1233447      4551.11
    6189.055     0.999805      1233476      5120.00
    6242.303     0.999829      1233508      5851.43
    6303.743     0.999854      1233536      6826.67
    6361.087     0.999878      1233567      8192.00
    6397.951     0.999890      1233582      9102.22
    6410.239     0.999902      1233599     10240.00
    6434.815     0.999915      1233611     11702.86
    6455.295     0.999927      1233628     13653.33
    6488.063     0.999939      1233642     16384.00
    6504.447     0.999945      1233649     18204.44
    6520.831     0.999951      1233658     20480.00
    6533.119     0.999957      1233666     23405.71
    6537.215     0.999963      1233671     27306.67
    6553.599     0.999969      1233680     32768.00
    6561.791     0.999973      1233685     36408.89
    6565.887     0.999976      1233688     40960.00
    6569.983     0.999979      1233691     46811.43
    6578.175     0.999982      1233695     54613.33
    6590.463     0.999985      1233698     65536.00
    6594.559     0.999986      1233700     72817.78
    6615.039     0.999988      1233701     81920.00
    6627.327     0.999989      1233704     93622.86
    6635.519     0.999991      1233706    109226.67
    6643.711     0.999992      1233707    131072.00
    6647.807     0.999993      1233708    145635.56
    6664.191     0.999994      1233710    163840.00
    6664.191     0.999995      1233710    187245.71
    6676.479     0.999995      1233713    218453.33
    6676.479     0.999996      1233713    262144.00
    6676.479     0.999997      1233713    291271.11
    6676.479     0.999997      1233713    327680.00
    6676.479     0.999997      1233713    374491.43
    6684.671     0.999998      1233715    436906.67
    6684.671     0.999998      1233715    524288.00
    6684.671     0.999998      1233715    582542.22
    6684.671     0.999998      1233715    655360.00
    6684.671     0.999999      1233715    748982.86
    6684.671     0.999999      1233715    873813.33
    6684.671     0.999999      1233715   1048576.00
    6684.671     0.999999      1233715   1165084.44
    6721.535     0.999999      1233716   1310720.00
    6721.535     1.000000      1233716          inf
#[Mean    =      171.843, StdDeviation   =      613.854]
#[Max     =     6717.440, Total count    =      1233716]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1257873 requests in 6.00m, 322.97MB read
  Non-2xx or 3xx responses: 66
Requests/sec:   3494.07
Transfer/sec:      0.90MB
thread 0 made 629619 requests and got 629595 responses
thread 1 made 628300 requests and got 628278 responses
2022-06-05 02:00:55.468 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN 
2022-06-05 02:01:00.634 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3504398826979471 
2022-06-05 02:01:05.663 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3418705694031556 
2022-06-05 02:01:10.611 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2829365573974822 
2022-06-05 02:01:15.648 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.296079930115746 
2022-06-05 02:01:20.613 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3096005154639174 
2022-06-05 02:01:25.560 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2959032702413142 
2022-06-05 02:01:30.572 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2973459289248763 
2022-06-05 02:01:35.521 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.314847353393367 
2022-06-05 02:01:40.568 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3031611677319053 
2022-06-05 02:01:45.522 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2943126308443824 
2022-06-05 02:01:50.497 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3103249264154209 
2022-06-05 02:01:55.552 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3071182548794489 
2022-06-05 02:02:00.500 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3106678230702515 
2022-06-05 02:02:05.591 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2975171748824876 
2022-06-05 02:02:10.518 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3019815796818308 
2022-06-05 02:02:15.520 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.301571821936668 
2022-06-05 02:02:20.530 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3258058955352525 
2022-06-05 02:02:25.532 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2784679089026916 
2022-06-05 02:02:30.509 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.281352423667414 
2022-06-05 02:02:35.600 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2787053393355745 
2022-06-05 02:02:40.522 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2723919915700737 
2022-06-05 02:02:45.531 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2809414466130884 
2022-06-05 02:02:50.533 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2937091034324417 
2022-06-05 02:02:55.539 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3246686176622482 
2022-06-05 02:03:00.565 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3199999999999998 
2022-06-05 02:03:05.646 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.304822223615727 
2022-06-05 02:03:10.544 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3049050889621978 
2022-06-05 02:03:15.529 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1043832940770955 
2022-06-05 02:03:20.548 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0998119979490686 
2022-06-05 02:03:25.534 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1314837153196622 
2022-06-05 02:03:30.548 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1038864827900616 
2022-06-05 02:03:35.549 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1235993794173418 
2022-06-05 02:03:40.553 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.124073754954334 
2022-06-05 02:03:45.576 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1124620060790273 
2022-06-05 02:03:50.548 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1360783184566658 
2022-06-05 02:03:55.547 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1104801239029427 
2022-06-05 02:04:00.571 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1358222629409072 
2022-06-05 02:04:05.551 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.118345240838903 
2022-06-05 02:04:10.618 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1470235031737863 
2022-06-05 02:04:15.584 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.119304347826087 
2022-06-05 02:04:20.561 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1235101053722578 
2022-06-05 02:04:25.604 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1076739018971116 
2022-06-05 02:04:30.640 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1165715616629788 
2022-06-05 02:04:35.575 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1023971418693097 
2022-06-05 02:04:40.562 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1440225196759926 
2022-06-05 02:04:45.593 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1133967747449998 
2022-06-05 02:04:50.567 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1066436583261432 
2022-06-05 02:04:55.591 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1206837606837607 
2022-06-05 02:05:00.594 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.108182601205857 
2022-06-05 02:05:05.626 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1170478570055737 
2022-06-05 02:05:10.577 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1216673719847652 
2022-06-05 02:05:15.610 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.10625 
2022-06-05 02:05:20.590 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1120180618270232 
2022-06-05 02:05:25.587 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1845234675705176 
2022-06-05 02:05:30.618 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2667429225050044 
2022-06-05 02:05:35.586 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1106698895027625 
2022-06-05 02:05:40.646 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1116621067031465 
2022-06-05 02:05:45.616 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1095771216427868 
2022-06-05 02:05:50.616 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1031846401471601 
2022-06-05 02:05:55.595 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1325017245343756 
2022-06-05 02:06:00.631 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.121324367449282 
2022-06-05 02:06:05.653 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.099297315977422 
2022-06-05 02:06:10.668 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1070520231213872 
2022-06-05 02:06:15.606 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1032978537777003 
2022-06-05 02:06:20.621 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.117724715876478 
2022-06-05 02:06:25.624 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1075225561749324 
2022-06-05 02:06:30.610 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1182257507766655 
2022-06-05 02:06:35.636 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1223058501539513 
2022-06-05 02:06:40.614 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1147588110159259 
2022-06-05 02:06:45.658 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1047863247863248 
2022-06-05 02:06:50.616 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1080768340661884 
2022-06-05 02:06:55.636 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1116048538711332 
2022-06-05 02:07:00.619 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1089088680016348 
2022-06-05 02:07:05.621 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN